///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


const http = require('http');


//-------------------------------------------------------------------------------------------------------------------//


const request = http.request('http://www.baidu.com', {

	method: 'GET'

}, resp => {

	let result = '';

	console.log('[服务器响应状态码]: ', resp.statusCode);

	resp.on('data', chunk => {

		result += chunk.toString('utf-8');
	});

	resp.on('end', () => {

		console.log(result);
	});
});


request.write('a=1&b=2');
request.end();                  // 消息体结束


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////