///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


const sequelize = require('./db'),
	{DataTypes} = require('sequelize'),
	Student = require('./Student');


//-------------------------------------------------------------------------------------------------------------------//


/**
 * 外键的连接
 *
 *
 * A.hasOne(B);         // 一对一，外键在 A 中定义
 *
 * A.belongTo(B);       // 一对一，外键在 B 中定义
 *
 * A.hasMany(B);        // 一对多，外键在 B 中定义
 */


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


const Class = sequelize.define(
	'class',
	{
		name: {
			type: DataTypes.STRING,
			allowNull: false
		},
		openDate: {
			type: DataTypes.DATE,
			allowNull: false
		},
	},
	{
		createdAt: false,
		updatedAt: false,
		paranoid: true
	}
);

/** 建立外键 **/
Class.hasOne(Student);


//-------------------------------------------------------------------------------------------------------------------//


module.exports = Class;


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
