///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


const express = require("express"),
	http = require('http');


//-------------------------------------------------------------------------------------------------------------------//


/**
 * 配置请求映射，根绝不同的请求( 若请求方法和路径均满足后 )，匹配不同的处理函数
 *
 *
 * const app = express();
 * app.method(path, fn);
 */

/**
 * REST STYLE API
 *
 *
 * /api/test    post        根据不同方法执行不同的请求
 *              get
 *              put
 *              delete
 *              ...
 *
 *              all                     匹配所有方法
 *
 *              all('*', ()=>{});       匹配所有路径
 */

/**
 * nodemon              // 监听文件变化， 当文件内容发生改变时自动更新并重新执行文件
 *
 *
 * npm i -D nodemon
 *
 *
 *
 * npx nodemo index.js
 *
 * "scripts": {
 *     "start": "nodemon --x npm run server",
 *     "server": "node index"
 * }
 *
 ** 利用 nodemon.json 扩展细节配置
 */


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


const app = express(),
	port = 9527;


/** 配置请求映射 **/
app.get('*', ((req, res) => {

	res.send('hello world');
}));


app.listen(port, () => {

	console.log(`server listen on ${port}`);
});



///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
