///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





//-------------------------------------------------------------------------------------------------------------------//


/**
 * jsonp
 *
 *
 * 1. 浏览器端生成一个 script 元素，访问数据接口
 * 2. 服务器响应一段JS代码，调用某个函数，并把响应的数据传入
 */

function jsonp(url) {

	const sript = document.createElement('script');
	sript.src = url;
	document.body.appendChild(sript);
	sript.onload = function () {
		sript.remove();
	};
}

function callback(data) {

	console.log(data);
}

jsonp('http://localhost:9527/api/student');


//-------------------------------------------------------------------------------------------------------------------//





///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
